<?php
class utf8_chinese
{
      private $utf8_gb2312;
      private $utf8_big5;
      public function __construct()
      {
            $this->utf8_gb2312 = "萬與丑專業叢東絲丟兩嚴喪個丬豐臨為麗舉麼義烏樂喬習鄉書買亂爭於虧雲亘亞產畝親亵亸億僅從侖倉儀們價眾優伙會伛傘偉傳傷伥倫伧偽伫體余傭佥俠侶僥偵側僑儈侪侬俣俦俨倆俪儉債傾偬偻偾償傥傧儲傩兒兌兖黨蘭關興茲養獸冁內岡冊寫軍農冢馮沖決況凍淨淒涼凌減湊凜幾鳳凫憑凱擊凼鑿刍劃劉則剛創刪別刬刭劊刿剀劑剮劍剝劇勸辦務劢動勵勁勞勢勳勐勚勻匦匮區醫華協單賣盧鹵臥衛卻卺廠廳歷厲壓厭厍廁廂厣廈廚廄厮縣參叆叇雙發變敘疊葉號歎叽吁後嚇呂嗎吣噸聽啟吳呒呓嘔呖呗員呙嗆嗚詠咔嚨咛咝咤咴鹹哌響啞哒哓哔哕嘩哙哜哝喲唛唝唠唡唢唣喚唿啧啬啭嚙啰啴嘯噴喽喾嗫呵嗳噓嘤囑噜噼囂嚯團園囪圍囵國圖圓聖圹場坂壞塊堅壇坜壩塢墳墜壟垅垆壘墾垧垩墊垭垯垱垲垴埘埙埚埝埯塹墮塆牆壯聲殼壺壸處備復夠頭誇夾奪奁奂奮獎奧妝婦媽妩妪妫姗姜婁娅娆嬌娈娛娲娴婳嬰婵嬸媪嫒嫔嫱嬷孫學孿寧寶實寵審憲宮寬賓寢對尋導壽將爾塵堯尴屍盡層屃屜屆屬屢屦嶼歲豈岖崗岘岙岚島嶺岳岽巋峃峄峽峣峤峥巒崂崃崄嶄嵘嵚嵛嵝嵴巅鞏巯幣帥師帏帳簾幟帶幀幫帱帻帼冪幞干並廣莊慶廬庑庫應廟龐廢庼廪開異棄張彌弪彎彈強歸當錄彟彥徹徑徕御憶忏憂忾懷態慫怃怄怅怆憐總怼怿戀懇惡恸恹恺恻惱恽悅悫懸悭憫驚懼慘懲憊惬慚憚慣愍愠憤愦願懾慭憷懑懶懔戆戋戲戗戰戬戶扎撲扦執擴扪掃揚擾撫拋抟摳掄搶護報擔擬攏揀擁攔擰撥擇掛摯攣挜撾撻挾撓擋挢掙擠揮挦撈損撿換搗據捻擄掴擲撣摻掼揸攬揿攙擱摟攪攜攝摅擺搖擯攤撄撐攆撷撸撺擻攢敵斂數齋斓斗斬斷無舊時曠旸昙晝昽顯晉曬曉晔暈晖暫暧札術樸機殺雜權條來楊杩傑極構枞樞棗枥枧枨槍楓枭櫃檸柽栀柵標棧栉栊棟栌栎欄樹棲樣栾桊桠桡桢檔桤橋桦桧槳樁夢梼梾檢棂椁椟椠椤橢樓榄榇榈榉槚檻槟槠橫樯櫻橥櫥橹橼檐檩歡欤歐殲殁殇殘殒殓殚殡毆毀毂畢斃氈毵氇氣氫氩氲匯漢污湯洶沓溝沒沣漚瀝淪滄沨沩滬沵濘淚泶泷泸泺瀉潑澤泾潔灑窪浃淺漿澆浈浉濁測浍濟浏浐渾浒濃浔浕塗湧濤澇涞漣涠渦涢渙滌潤澗漲澀澱淵渌漬渎漸渑漁渖滲溫游灣濕潰濺溆溇滗滾滯滟滠滿滢濾濫灤濱灘滪漤潆潇潋濰潛潴瀾濑瀕灏滅燈靈災燦炀爐炖炜炝點煉熾爍爛烴燭煙煩燒烨燴燙燼熱煥焖焘煅煳熘愛爺牍牦牽犧犢犟狀犷犸猶狽狍狝獰獨狹獅狯猙獄狲猃獵猕猡豬貓猬獻獺玑玙玚瑪玮環現玱玺珉珏琺珑珰珲琎琏瑣瓊瑤瑷璇璎瓒甕瓯電畫暢畲疇疖療瘧疠瘍疬瘡瘋疱疴癰痙癢痖痨瘓痫癡瘅瘆瘗瘘癟癱瘾瘿癞癬癫癯皚皺皲盞鹽監蓋盜盤眍眦眬著睜睐睑瞞矚矯矶礬礦砀碼磚砗硯砜砺砻礫礎硁硅碩硖硗硙硚確硷礙碛碜鹼碹磙禮祎祢祯禱禍禀祿禅離禿稈種積稱穢秾稆稅稣穩穑窮竊竅窯竄窩窺窦窭豎競笃筍筆笕箋籠笾築筚篩筜筝籌簽簡箓箦箧箨籮箪箫篑簍籃籬簖籁籴類籼粜粝粵糞糧糁糇緊絷纟糾纡紅纣纖纥約級纨纩紀紉緯纭纮純纰紗綱納纴縱綸紛紙紋紡纻纼紐纾線绀绁绂練組紳細織終绉絆绋绌紹繹經绐綁絨結绔繞绖绗繪給絢绛絡絕絞統绠绡絹繡绤綏絛繼绨績緒绫绬續绮绯綽绱绲繩維綿绶繃綢绹绺绻綜綻绾綠綴缁缂缃緘緬纜缇缈緝缊缋缌缍緞缏缐缑缒緩締縷編缗緣缙縛缛缜縫缞缟纏缡缢缣缤缥缦缧纓縮缪缫缬缭繕缯缰缱缲缳繳缵罂網羅罰罷罴羁羟羨翹翙翚耢耧聳恥聶聾職聍聯聩聰肅腸膚肷腎腫脹脅膽勝胧胨胪胫膠脈脍髒臍腦膿脔腳脫脶臉臘腌腘腭膩腼腽騰膑臜輿舣艦艙舻艱艷艹藝節芈芗蕪蘆苁葦苈苋苌蒼苎蘇苘蘋莖茏茑茔茕繭荊薦荙莢荛荜荞荟荠蕩榮葷荥荦熒荨荩荪蔭荬荭荮藥莅莜萊蓮莳莴莶獲莸瑩莺莼萚蘿螢營萦蕭薩蔥蒇蒉蔣蒌藍薊蓠蓣蓥蓦薔蔹蔺藹蕲蘊薮藁藓虜慮虛蟲虬虮雖蝦虿蝕蟻螞蠶蚝蚬蠱蛎蛏蠻蟄蛱蛲蛳蛴蛻蝸蠟蠅蝈蟬蠍蝼蝾螀螨蟏釁銜補襯衮襖袅袆襪襲袯裝裆裈裢裣褲裥褛褴襁襕見觀觃規覓視觇覽覺觊觋觌觍觎觏觐觑觞觸觯詟譽謄讠計訂訃認譏讦讧討讓讪訖訓議訊記讱講諱讴讵訝讷許訛論讻訟諷設訪訣證诂诃評詛識诇詐訴診诋謅詞诎诏诐譯诒诓诔試诖詩诘诙誠誅诜話誕诟诠詭詢詣诤該詳詫诨诩诪誡誣語诮誤诰誘誨诳說誦诶請諸诹諾讀诼誹課诿谀誰谂調谄諒諄谇談誼謀谌諜謊谏諧谑谒謂谔谕谖讒谘谙諺谛謎谝谞谟谠谡謝謠謗谥謙谧謹謾谪谫謬譚谮谯讕譜谲谳譴谵谶谷豮貝貞負贠貢財責賢敗賬貨質販貪貧貶購貯貫貳賤贲贳貼貴贶貸貿費賀贻賊贽賈賄赀賃賂贓資赅赆赇赈赉賒賦賭赍贖賞賜赑赒赓賠赕賴赗贅赙賺賽赜赝贊赟贈贍贏贛赪趙趕趨趱趸躍跄跖跞踐跶跷跸跹跻踴躊蹤踬踯蹑蹒蹰躥躏躜軀車軋軌軒轪轫轉轭輪軟轟轱轲轳軸轵轶轷轸轹轺輕轼載轾轎辀辁辂較辄輔輛辇輩輝輥辋辌辍辎辏輻輯辒輸辔轅轄輾辘轍辚辭辯辮邊遼達遷過邁運還這進遠違連遲迩迳跡適選遜遞逦邏遺遙鄧邝邬郵鄒邺鄰郁郄郏郐鄭郓郦鄖鄲醞酦醬酽酾釀釋裡鉅鑒銮錾钆钇針釘钊钋钌钍釬钏钐钑釩釣钔钕钖钗钘鈣钚钛鈍鈔鐘鈉鋇鋼钣钤鑰欽鈞鎢鉤钪钫钬钭鈕钯钰錢钲鉗钴缽钶钷钸钹钺鑽钼钽鉀钿鈾鐵鉑鈴铄鉛鉚铈铉铊铋铍铎铏铐铑铒铕铗铘铙铚铛銅鋁铞铟铠鍘铢銑铤铥铦铧铨铪铫鉻銘铮铯鉸銥鏟铳铴铵銀铷鑄铹鋪铻铼铽鏈铿銷鎖锂锃鋤鍋锆锇銹锉锊鋒鋅锍锎锏銳銻锒锓锔锕锖鍺錯錨锜锞锟锠錫锢鑼錘錐錦掀锩锫锬錠鍵鋸錳锱锲锳锴锵锶锷锸鍬锺鍛锼锽锾锿鍍鎂镂镃镆鎮镈镉鑷镌鎳镎镏鎬鎊镒镕镖镗镙镚镛鏡镝镞镟镠镡镢鐐镤镥镦镧镨镩镪镫镬鐳镮镯鐮镱镲镳镴鑲長門闩閃闫闬閉問闖閏闱閒闳間闵闶悶閘鬧閨聞闼閩闾闿閥閣閡阃阄閱阆阇阈閹阊阋阌阍閻阏闡闌阒阓闊阕阖阗阘阙阚阛隊陽陰陣階際陸隴陳陉陝陧隕險隨隱隸隽難雛雠雳霧霁霉霭靓靜靥鞑鞒鞯鞴韋韌韨韓韪韫韬韻頁頂頃顸項順須顼頑顧頓颀頒頌颃預顱領頗頸颉頰颋颌颍颎颏頤頻颒頹颔颕穎顆題颙颚颛顏額颞颟顛颡颢颣顫颥颦顴風飏飐飑飒飓飔飕飖飗飄飙飚飛飨餍饤饑饦饧饨饩饪饫饬飯飲餞飾飽飼饳饴餌饒饷饸饹餃饻餅饽饾餓馀餒馂馃馄餡館馇饋馉馊饞馌馍馎餾馐馑饅馓馔馕馬馭馱馴馳驅驲駁驢驵駛驷驸駒驺駐駝驽駕驿骀骁罵骃驕骅駱駭骈骉骊騁驗骍骎駿骐騎骒骓骔骕骖騙骘骙騷骛骜骝骞骟骠騾骢骣驟骥骦骧髅髋髌鬓魇魉魚鱽鱾鱿鲀魯鲂鲄鲅鲆鲇鲈鲉鲊鲋鲌鮑鲎鲏鲐鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鮮鲝鲞鲟鲠鲡鲢鲣鯉鲥鲦鲧鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鯨鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鰓鳄鳅鳆鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐鳑鳒鳓鳔鳕鱉鳗鳘鳙鳛鳜鳝鱗鳟鳠鳡鳢鳣鳥鸠雞鸢鳴鸤鷗鴉鸧鸨鸩鸪鸫鸬鴨鸮鴦鸰鸱鸲鴛鸴鴕鸶鸷鸸鸹鸺鸻鸼鴿鸾鴻鹀鹁鹂鵑鹄鵝鹆鹇鹈鹉鵲鹋鹌鹍鹎鵬鹐鹑鹒鹓鹔鹕鹖鹗鹘鹚鹛鹜鹝鹞鹟鹠鹡鹢鹣鶴鹥鹦鹧鹨鹩鹪鹫鹬鹭鹯鷹鹱鹲鹳鹴鹾麥麸黃黉黡黩黪黾鼋鼌鼍鼗鼹齄齊齑齒龀龁龂龃齡龅龆龇龈龉龊齲龌龍龔龛龜志制咨只裡系范松沒嘗嘗鬧面准鐘別閒干盡髒拼";
            $this->utf8_big5 = "萬與醜專業叢東絲丟兩嚴喪個爿豐臨為麗舉麼義烏樂喬習鄉書買亂爭於虧雲亙亞產畝親褻嚲億僅從侖倉儀們價眾優夥會傴傘偉傳傷倀倫傖偽佇體餘傭僉俠侶僥偵側僑儈儕儂俁儔儼倆儷儉債傾傯僂僨償儻儐儲儺兒兌兗黨蘭關興茲養獸囅內岡冊寫軍農塚馮衝決況凍淨淒涼淩減湊凜幾鳳鳧憑凱擊氹鑿芻劃劉則剛創刪別剗剄劊劌剴劑剮劍剝劇勸辦務勱動勵勁勞勢勳猛勩勻匭匱區醫華協單賣盧鹵臥衛卻巹廠廳曆厲壓厭厙廁廂厴廈廚廄廝縣參靉靆雙發變敘疊葉號歎嘰籲後嚇呂嗎唚噸聽啟吳嘸囈嘔嚦唄員咼嗆嗚詠哢嚨嚀噝吒噅鹹呱響啞噠嘵嗶噦嘩噲嚌噥喲嘜嗊嘮啢嗩唕喚呼嘖嗇囀齧囉嘽嘯噴嘍嚳囁嗬噯噓嚶囑嚕劈囂謔團園囪圍圇國圖圓聖壙場阪壞塊堅壇壢壩塢墳墜壟壟壚壘墾坰堊墊埡墶壋塏堖塒塤堝墊垵塹墮壪牆壯聲殼壺壼處備複夠頭誇夾奪奩奐奮獎奧妝婦媽嫵嫗媯姍薑婁婭嬈嬌孌娛媧嫻嫿嬰嬋嬸媼嬡嬪嬙嬤孫學孿寧寶實寵審憲宮寬賓寢對尋導壽將爾塵堯尷屍盡層屭屜屆屬屢屨嶼歲豈嶇崗峴嶴嵐島嶺嶽崠巋嶨嶧峽嶢嶠崢巒嶗崍嶮嶄嶸嶔崳嶁脊巔鞏巰幣帥師幃帳簾幟帶幀幫幬幘幗冪襆幹並廣莊慶廬廡庫應廟龐廢廎廩開異棄張彌弳彎彈強歸當錄彠彥徹徑徠禦憶懺憂愾懷態慫憮慪悵愴憐總懟懌戀懇惡慟懨愷惻惱惲悅愨懸慳憫驚懼慘懲憊愜慚憚慣湣慍憤憒願懾憖怵懣懶懍戇戔戲戧戰戩戶紮撲扡執擴捫掃揚擾撫拋摶摳掄搶護報擔擬攏揀擁攔擰撥擇掛摯攣掗撾撻挾撓擋撟掙擠揮撏撈損撿換搗據撚擄摑擲撣摻摜摣攬撳攙擱摟攪攜攝攄擺搖擯攤攖撐攆擷擼攛擻攢敵斂數齋斕鬥斬斷無舊時曠暘曇晝曨顯晉曬曉曄暈暉暫曖劄術樸機殺雜權條來楊榪傑極構樅樞棗櫪梘棖槍楓梟櫃檸檉梔柵標棧櫛櫳棟櫨櫟欄樹棲樣欒棬椏橈楨檔榿橋樺檜槳樁夢檮棶檢欞槨櫝槧欏橢樓欖櫬櫚櫸檟檻檳櫧橫檣櫻櫫櫥櫓櫞簷檁歡歟歐殲歿殤殘殞殮殫殯毆毀轂畢斃氈毿氌氣氫氬氳彙漢汙湯洶遝溝沒灃漚瀝淪滄渢溈滬濔濘淚澩瀧瀘濼瀉潑澤涇潔灑窪浹淺漿澆湞溮濁測澮濟瀏滻渾滸濃潯濜塗湧濤澇淶漣潿渦溳渙滌潤澗漲澀澱淵淥漬瀆漸澠漁瀋滲溫遊灣濕潰濺漵漊潷滾滯灩灄滿瀅濾濫灤濱灘澦濫瀠瀟瀲濰潛瀦瀾瀨瀕灝滅燈靈災燦煬爐燉煒熗點煉熾爍爛烴燭煙煩燒燁燴燙燼熱煥燜燾煆糊溜愛爺牘犛牽犧犢強狀獷獁猶狽麅獮獰獨狹獅獪猙獄猻獫獵獼玀豬貓蝟獻獺璣璵瑒瑪瑋環現瑲璽瑉玨琺瓏璫琿璡璉瑣瓊瑤璦璿瓔瓚甕甌電畫暢佘疇癤療瘧癘瘍鬁瘡瘋皰屙癰痙癢瘂癆瘓癇癡癉瘮瘞瘺癟癱癮癭癩癬癲臒皚皺皸盞鹽監蓋盜盤瞘眥矓著睜睞瞼瞞矚矯磯礬礦碭碼磚硨硯碸礪礱礫礎硜矽碩硤磽磑礄確鹼礙磧磣堿镟滾禮禕禰禎禱禍稟祿禪離禿稈種積稱穢穠穭稅穌穩穡窮竊竅窯竄窩窺竇窶豎競篤筍筆筧箋籠籩築篳篩簹箏籌簽簡籙簀篋籜籮簞簫簣簍籃籬籪籟糴類秈糶糲粵糞糧糝餱緊縶糸糾紆紅紂纖紇約級紈纊紀紉緯紜紘純紕紗綱納紝縱綸紛紙紋紡紵紖紐紓線紺絏紱練組紳細織終縐絆紼絀紹繹經紿綁絨結絝繞絰絎繪給絢絳絡絕絞統綆綃絹繡綌綏絛繼綈績緒綾緓續綺緋綽緔緄繩維綿綬繃綢綯綹綣綜綻綰綠綴緇緙緗緘緬纜緹緲緝縕繢緦綞緞緶線緱縋緩締縷編緡緣縉縛縟縝縫縗縞纏縭縊縑繽縹縵縲纓縮繆繅纈繚繕繒韁繾繰繯繳纘罌網羅罰罷羆羈羥羨翹翽翬耮耬聳恥聶聾職聹聯聵聰肅腸膚膁腎腫脹脅膽勝朧腖臚脛膠脈膾髒臍腦膿臠腳脫腡臉臘醃膕齶膩靦膃騰臏臢輿艤艦艙艫艱豔艸藝節羋薌蕪蘆蓯葦藶莧萇蒼苧蘇檾蘋莖蘢蔦塋煢繭荊薦薘莢蕘蓽蕎薈薺蕩榮葷滎犖熒蕁藎蓀蔭蕒葒葤藥蒞蓧萊蓮蒔萵薟獲蕕瑩鶯蓴蘀蘿螢營縈蕭薩蔥蕆蕢蔣蔞藍薊蘺蕷鎣驀薔蘞藺藹蘄蘊藪槁蘚虜慮虛蟲虯蟣雖蝦蠆蝕蟻螞蠶蠔蜆蠱蠣蟶蠻蟄蛺蟯螄蠐蛻蝸蠟蠅蟈蟬蠍螻蠑螿蟎蠨釁銜補襯袞襖嫋褘襪襲襏裝襠褌褳襝褲襇褸襤繈襴見觀覎規覓視覘覽覺覬覡覿覥覦覯覲覷觴觸觶讋譽謄訁計訂訃認譏訐訌討讓訕訖訓議訊記訒講諱謳詎訝訥許訛論訩訟諷設訪訣證詁訶評詛識詗詐訴診詆謅詞詘詔詖譯詒誆誄試詿詩詰詼誠誅詵話誕詬詮詭詢詣諍該詳詫諢詡譸誡誣語誚誤誥誘誨誑說誦誒請諸諏諾讀諑誹課諉諛誰諗調諂諒諄誶談誼謀諶諜謊諫諧謔謁謂諤諭諼讒諮諳諺諦謎諞諝謨讜謖謝謠謗諡謙謐謹謾謫譾謬譚譖譙讕譜譎讞譴譫讖穀豶貝貞負貟貢財責賢敗賬貨質販貪貧貶購貯貫貳賤賁貰貼貴貺貸貿費賀貽賊贄賈賄貲賃賂贓資賅贐賕賑賚賒賦賭齎贖賞賜贔賙賡賠賧賴賵贅賻賺賽賾贗讚贇贈贍贏贛赬趙趕趨趲躉躍蹌蹠躒踐躂蹺蹕躚躋踴躊蹤躓躑躡蹣躕躥躪躦軀車軋軌軒軑軔轉軛輪軟轟軲軻轤軸軹軼軤軫轢軺輕軾載輊轎輈輇輅較輒輔輛輦輩輝輥輞輬輟輜輳輻輯轀輸轡轅轄輾轆轍轔辭辯辮邊遼達遷過邁運還這進遠違連遲邇逕跡適選遜遞邐邏遺遙鄧鄺鄔郵鄒鄴鄰鬱郤郟鄶鄭鄆酈鄖鄲醞醱醬釅釃釀釋裏钜鑒鑾鏨釓釔針釘釗釙釕釷釺釧釤鈒釩釣鍆釹鍚釵鈃鈣鈈鈦鈍鈔鍾鈉鋇鋼鈑鈐鑰欽鈞鎢鉤鈧鈁鈥鈄鈕鈀鈺錢鉦鉗鈷缽鈳鉕鈽鈸鉞鑽鉬鉭鉀鈿鈾鐵鉑鈴鑠鉛鉚鈰鉉鉈鉍鈹鐸鉶銬銠鉺銪鋏鋣鐃銍鐺銅鋁銱銦鎧鍘銖銑鋌銩銛鏵銓鉿銚鉻銘錚銫鉸銥鏟銃鐋銨銀銣鑄鐒鋪鋙錸鋱鏈鏗銷鎖鋰鋥鋤鍋鋯鋨鏽銼鋝鋒鋅鋶鐦鐧銳銻鋃鋟鋦錒錆鍺錯錨錡錁錕錩錫錮鑼錘錐錦鍁錈錇錟錠鍵鋸錳錙鍥鍈鍇鏘鍶鍔鍤鍬鍾鍛鎪鍠鍰鎄鍍鎂鏤鎡鏌鎮鎛鎘鑷鐫鎳鎿鎦鎬鎊鎰鎔鏢鏜鏍鏰鏞鏡鏑鏃鏇鏐鐔钁鐐鏷鑥鐓鑭鐠鑹鏹鐙鑊鐳鐶鐲鐮鐿鑔鑣鑞鑲長門閂閃閆閈閉問闖閏闈閑閎間閔閌悶閘鬧閨聞闥閩閭闓閥閣閡閫鬮閱閬闍閾閹閶鬩閿閽閻閼闡闌闃闠闊闋闔闐闒闕闞闤隊陽陰陣階際陸隴陳陘陝隉隕險隨隱隸雋難雛讎靂霧霽黴靄靚靜靨韃鞽韉韝韋韌韍韓韙韞韜韻頁頂頃頇項順須頊頑顧頓頎頒頌頏預顱領頗頸頡頰頲頜潁熲頦頤頻頮頹頷頴穎顆題顒顎顓顏額顳顢顛顙顥纇顫顬顰顴風颺颭颮颯颶颸颼颻飀飄飆飆飛饗饜飣饑飥餳飩餼飪飫飭飯飲餞飾飽飼飿飴餌饒餉餄餎餃餏餅餑餖餓餘餒餕餜餛餡館餷饋餶餿饞饁饃餺餾饈饉饅饊饌饢馬馭馱馴馳驅馹駁驢駔駛駟駙駒騶駐駝駑駕驛駘驍罵駰驕驊駱駭駢驫驪騁驗騂駸駿騏騎騍騅騌驌驂騙騭騤騷騖驁騮騫騸驃騾驄驏驟驥驦驤髏髖髕鬢魘魎魚魛魢魷魨魯魴魺鮁鮃鯰鱸鮋鮓鮒鮊鮑鱟鮍鮐鮭鮚鮳鮪鮞鮦鰂鮜鱠鱭鮫鮮鮺鯗鱘鯁鱺鰱鰹鯉鰣鰷鯀鯊鯇鮶鯽鯒鯖鯪鯕鯫鯡鯤鯧鯝鯢鯰鯛鯨鯵鯴鯔鱝鰈鰏鱨鯷鰮鰃鰓鱷鰍鰒鰉鰁鱂鯿鰠鼇鰭鰨鰥鰩鰟鰜鰳鰾鱈鱉鰻鰵鱅鰼鱖鱔鱗鱒鱯鱤鱧鱣鳥鳩雞鳶鳴鳲鷗鴉鶬鴇鴆鴣鶇鸕鴨鴞鴦鴒鴟鴝鴛鴬鴕鷥鷙鴯鴰鵂鴴鵃鴿鸞鴻鵐鵓鸝鵑鵠鵝鵒鷳鵜鵡鵲鶓鵪鶤鵯鵬鵮鶉鶊鵷鷫鶘鶡鶚鶻鶿鶥鶩鷊鷂鶲鶹鶺鷁鶼鶴鷖鸚鷓鷚鷯鷦鷲鷸鷺鸇鷹鸌鸏鸛鸘鹺麥麩黃黌黶黷黲黽黿鼂鼉鞀鼴齇齊齏齒齔齕齗齟齡齙齠齜齦齬齪齲齷龍龔龕龜誌製谘隻裡係範鬆冇嚐嘗鬨麵準鐘彆閒乾儘臟拚";
      }
      public function gb2312_big5($str)
      {
            $str_t = '';
            $len = mb_strlen($str);
            $a = 0;
            while ($a < $len) {
                  if (ord($str[$a]) >= 224 && ord($str[$a]) <= 239) {
                        if (($temp = strpos($this->utf8_gb2312, $str[$a] . $str[$a + 1] . $str[$a + 2])) !== false) {
                              $str_t .= $this->utf8_big5[$temp] . $this->utf8_big5[$temp + 1] . $this->utf8_big5[$temp + 2];
                              $a += 3;
                              continue;
                        }
                  }
                  $str_t .= $str[$a];
                  $a += 1;
            }
            return $str_t;
      }
      public function big5_gb2312($str)
      {
            $str_t = '';
            $len = mb_strlen($str);
            $a = 0;
            while ($a < $len) {
                  if (ord($str[$a]) >= 224 && ord($str[$a]) <= 239) {
                        if (($temp = strpos($this->utf8_big5, $str[$a] . $str[$a + 1] . $str[$a + 2])) !== false) {
                              $str_t .= $this->utf8_gb2312[$temp] . $this->utf8_gb2312[$temp + 1] . $this->utf8_gb2312[$temp + 2];
                              $a += 3;
                              continue;
                        }
                  }
                  $str_t .= $str[$a];
                  $a += 1;
            }
            return $str_t;
      }
}

